# join
두개 이상의 테이블을 흩어진 정보들을 이어 붙이기 위한 함수.


- sql join 시각화 : https://sql-joins.leopard.in.ua/

- sql 데이터 : https://www.w3schools.com/sql/trysql.asp?filename=trysql_op_in

<br><br>

--------

## 1. inner join -> 교집합.
- 서로 공통적인 부분을 갖고 있을 때 사용.
- 양 쪽 테이블에 정보가 있을 때만 출력이 된다.

**<구조>**

SELECT *

FROM Table1

    INNER JOIN Table2 ON key1 = key2

여태까지, FROM에 테이블 하나만 넣었다. 

테이블 두개 이상을 넣을 경우 **FROM users, orders** 조합에서 나올 수 있는 모든 조합이 나온다. 

그 조합 안에서 **WHERE** 문을 통해 우리가 원하는 테이블을 만들어야 한다

## inner join 코드

###### OLD 코드

In [5]:
'''
SELECT *
FROM usrs, orders  // 테이블 두개
WHERE user.id = orders.userid // WHERE 조건
'''

'\nSELECT *\nFROM usrs, orders  // 테이블 두개\nWHERE user.id = orders.userid // WHERE 조건\n'

### NEW 코드
두 개의 코드는 결과는 같지만 new 버전 코드를 사용하자.

In [6]:
'''
SELECT *
FROM users
    INNER JOIN orders ON users.id = orders.usersid
'''

'\nSELECT *\nFROM users\n    INNER JOIN orders ON users.id = orders.usersid\n'

<br><br>

## inner join 예시
주문 고객 번호와 고객 번호가 일치한 사람 테이블을 보고 싶다. 

-> 왼쪽은 order 정보, 오른쪽은 customer 정보가 나온다

In [8]:
'''
SELECT *
FROM orders
    INNER JOIN customers ON orders.customerid = customers.customerid
'''

'\nSELECT *\nFROM orders\n    INNER JOIN customers ON orders.customerid = customers.customerid\n'

## inner join 예시
주문 고객번호/ 고객번호 일치 & order.shippers = shippers.id 일치한 것을 보고 싶다.

-> inner join을 여러개 사용할 수 있다. 

-> 왼쪽은 order, 가운데 customer, 오른쪽 shipper

In [9]:
'''
SELECT *
FROM orders
    INNER JOIN customers ON orders.customerid = customers.customerid
    INNER JOIN Shippers ON orders.Shipperid = Shippers.Shipperid    
'''

'\nSELECT *\nFROM orders\n    INNER JOIN customers ON orders.customerid = customers.customerid\n    INNER JOIN Shippers ON orders.Shipperid = Shippers.Shipperid    \n'

<BR><BR>

##### ERD ; 데이터 베이스의 도식화
컬럼명 또는 컬럼의 값이 다를 경우 데이터가 너무 복잡할 때 ERD를 통해 관계를 나타낸다. 하지만 이 내용은 고급에서 진행 될 예정

<BR><BR>

------

## 2. OUTER JOIN(LEFT, RIGHT)
- INNER JOIN과 다르게 OUTER JOIN은 테이블에 값이 없어도 NULL이 출력된다.

<BR>

### 1) LEFT JOIN : 왼쪽 테이블 기준.

왼쪽 테이블을 기준으로 왼쪽 테이블에만 속한 것들만 나옴. 

(왼쪽 테이블에 속하지 않은 오른쪽 테이블을 출력 안됨)

<br><br>

#### 간단한 예시

한번도 주문하지 않은 고객도 나올 수 있음.

In [10]:
'''
SELECT *
FROM users
    LEFT JOIN orders ON users.id = orders.userid
'''

'\nSELECT *\nFROM users\n    LEFT JOIN orders ON users.id = orders.userid\n'

<br><br>

### LEFT JOIN 예시
- 왼쪽 테이블을 기준으로 한번도 주문하지 않은 고객을 출력해라

In [11]:
'''
SELECT *
FROM customers
    LEFT JOIN orders ON customers.customerid = orders.customerid
WHERE orderid IS NULL
'''

'\nSELECT *\nFROM customers\n    LEFT JOIN orders ON customers.customerid = orders.customerid\nWHERE orderid IS NULL\n'

<br><br>

### 2) RIGHT  JOIN : 오른쪽 테이블 기준.

대부분 보통 LEFT JOIN 사용

<BR><BR>
    
-------

<BR>

# 문제 1: INNER JOIN
시티.컨트리 코드와 컨트리 코드가 같다. 이 때 컨텐트가 아프리카인 도시의 이름을 출력해라

https://www.hackerrank.com/challenges/african-cities/problem?h_r=internal-search

In [1]:
'''
SELECT CITY.NAME
FROM CITY 
    INNER JOIN COUNTRY ON CITY.CountryCode = COUNTRY.Code 
WHERE COUNTRY.CONTINENT = 'Africa'
'''

"\nSELECT CITY.NAME\nFROM CITY \n    INNER JOIN COUNTRY ON CITY.CountryCode = COUNTRY.Code \nWHERE COUNTRY.CONTINENT = 'Africa'\n"

<BR>

# 문제 2: SUM
시티.컨트리 코드와 컨트리 코드가 같다. 이 때 컨텐트가 아시아인 도시의 유명세의 합을 출력해라

https://www.hackerrank.com/challenges/asian-population/problem?h_r=internal-search

In [3]:
'''
SELECT SUM(CITY.POPULATION)
FROM CITY
    INNER JOIN COUNTRY ON CITY.CountryCode = COUNTRY.Code 
WHERE COUNTRY.CONTINENT = 'ASIA'
'''

"\nSELECT SUM(CITY.POPULATION)\nFROM CITY\n    INNER JOIN COUNTRY ON CITY.CountryCode = COUNTRY.Code \nWHERE COUNTRY.CONTINENT = 'ASIA'\n"

<BR>

# 문제 3: FLOOR
대륙 별 도시의 유명세를 반올림해라

https://www.hackerrank.com/challenges/average-population-of-each-continent/problem?h_r=internal-search

In [5]:
'''
SELECT COUNTRY.Continent
       , FLOOR(AVG(CITY.Population))
FROM CITY 
    INNER JOIN COUNTRY ON CITY.CountryCode = COUNTRY.Code
GROUP BY COUNTRY.Continent
'''

'\nSELECT COUNTRY.Continent\n       , FLOOR(AVG(CITY.Population))\nFROM CITY \n    INNER JOIN COUNTRY ON CITY.CountryCode = COUNTRY.Code\nGROUP BY COUNTRY.Continent\n'

<BR>

# 문제 4: WHERE IS NULL

NULL 값을 찾을 때는, **WHERE 컬럼 IS NULL**

https://leetcode.com/problems/customers-who-never-order/

In [6]:
'''
SELECT c.NAME AS Customers
FROM Customers AS c
    LEFT JOIN Orders AS o ON c.ID = o.CustomerID 
WHERE o.ID IS NULL
'''

'\nSELECT c.NAME AS Customers\nFROM Customers AS c\n    LEFT JOIN Orders AS o ON c.ID = o.CustomerID \nWHERE o.ID IS NULL\n'

<BR>

# 문제 5: Self JOIN
사수 보다 돈을 더 많이 버는 직원을 찾아라

##### **정답** : 직원's 매니저 아이디 = 매니저's 아이디

In [9]:
'''
SELECT E.NAME AS Employee
FROM Employee AS E
    INNER JOIN Employee AS M ON E.ManagerID = M.Id  
WHERE E.Salary> M.salary

'''

'\nSELECT E.NAME AS Employee\nFROM Employee AS E\n    INNER JOIN Employee AS M ON E.ManagerID = M.Id  \nWHERE E.Salary> M.salary\n\n'

##### 왜 틀렸는지 아무리 생각해도 모르겠음... -> 이유를 찾았다... => Seif JOIN을 할 때, 꼭 AS 사용하자

##### **오답* : 직원's 직원 아이디 = 매니저's  매니저 아이디

In [10]:
'''
SELECT *
FROM Employee AS E
    INNER JOIN Employee AS M ON E.Id = M.ManagerId  
WHERE E.Salary> M.salary
'''

'\nSELECT *\nFROM Employee AS E\n    INNER JOIN Employee AS M ON E.Id = M.ManagerId  \nWHERE E.Salary> M.salary\n'

<br>

# 문제 5: DATE_ADD(기준날짜, INTERVAL)
전 날 보다 온도가 오른 날은 언제인가?

https://leetcode.com/problems/rising-temperature/

In [13]:
'''
SELECT Weather.ID AS ID
FROM Weather
    INNER JOIN Weather AS copy ON Weather.RecordDate = DATE_ADD(copy.RecordDate, INTERVAL 1 DAY)
WHERE Weather.Temperature > copy.Temperature    
'''

'\nSELECT Weather.ID AS ID\nFROM Weather\n    INNER JOIN Weather AS copy ON Weather.RecordDate = DATE_ADD(copy.RecordDate, INTERVAL 1 DAY)\nWHERE Weather.Temperature > copy.Temperature    \n'

##### **오답* : MYSQL 날짜를 이렇게 더하면 안된다. DATE_ADD/DATE_SUB를 사용해야한다

In [12]:
'''
SELECT Weather.ID AS ID
FROM Weather
    INNER JOIN Weather AS copy ON Weather.RecordDate = copy.RecordDate+1
WHERE Weather.Temperature > copy.Temperature    
'''

'\nSELECT Weather.ID AS ID\nFROM Weather\n    INNER JOIN Weather AS copy ON Weather.RecordDate = copy.RecordDate+1\nWHERE Weather.Temperature > copy.Temperature    \n'

### 참고: MYSQL 시간 더하기, 빼기

##### DATE_ADD(기준날짜, INTERVAL)
- SELECT DATE_ADD(NOW(), INTERVAL 1 SECOND)
- SELECT DATE_ADD(NOW(), INTERVAL 1 MINUTE)
- SELECT DATE_ADD(NOW(), INTERVAL 1 HOUR)
- SELECT DATE_ADD(NOW(), INTERVAL 1 DAY)
- SELECT DATE_ADD(NOW(), INTERVAL 1 MONTH)
- SELECT DATE_ADD(NOW(), INTERVAL 1 YEAR)
- SELECT DATE_ADD(NOW(), INTERVAL -1 YEAR)

##### DATE_SUB(기준날짜, INTERVAL)
- SELECT DATE_SUB(NOW(), INTERVAL 1 SECOND)